# =============================================================================
#  BREWFILE - Augusto Hermosilla
# =============================================================================
# Install with: brew bundle --file=~/Brewfile
# =============================================================================

# Modern CLI tools
brew "bat"        # better cat
brew "eza"        # better ls
brew "fd"         # better find
brew "fzf"        # fuzzy finder
brew "ripgrep"    # better grep
brew "starship"   # prompt
brew "zoxide"     # smarter cd

# Essentials
brew "curl"       # HTTP client
brew "git"        # version control
brew "htop"       # process viewer
brew "jq"         # JSON processor
brew "tldr"       # simplified man pages
brew "tmux"       # terminal multiplexer
brew "vim"        # text editor
brew "wget"       # file downloader
