# =============================================================================
#  BREWFILE - Augusto Hermosilla
# =============================================================================
# Install with: brew bundle --file=~/Brewfile
# =============================================================================

# Modern CLI tools
brew "bat"        # better cat
brew "eza"        # better ls
brew "fd"         # better find
brew "fzf"        # fuzzy finder
brew "ripgrep"    # better grep
brew "starship"   # prompt
brew "zoxide"     # smarter cd

# Git enhancements
brew "delta"      # better diff pager
brew "gh"         # GitHub CLI
brew "lazygit"    # TUI for git

# Essentials
brew "curl"       # HTTP client
brew "git"        # version control
brew "htop"       # process viewer
brew "jq"         # JSON processor
brew "ncdu"       # interactive disk usage
brew "tlrc"       # tldr in Rust
brew "tmux"       # terminal multiplexer
brew "tree"       # directory tree
brew "vim"        # text editor
brew "wget"       # file downloader

# Development
brew "node"       # Node.js
brew "pipx"       # Python CLI installer

# Media & sync
brew "ffmpeg"     # media processing
brew "rclone"     # cloud sync
brew "yt-dlp"     # video downloader

# AI
brew "ollama"     # local LLMs

# Casks
cask "docker"
cask "iterm2"
cask "keepassxc"
cask "obsidian"
cask "visual-studio-code"
